/*
*   Copyright (C) {2015}  {Victor Klafke, Charles TheHouse}
*
*   This program is free software: you can redistribute it and/or modify
*   it under the terms of the GNU General Public License as published by
*   the Free Software Foundation, either version 3 of the License, or
*   (at your option) any later version.
*
*   This program is distributed in the hope that it will be useful,
*   but WITHOUT ANY WARRANTY; without even the implied warranty of
*   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
*   GNU General Public License for more details.
*
*   You should have received a copy of the GNU General Public License
*   along with this program.  If not, see [http://www.gnu.org/licenses/].
*
*   Contact at: victor.klafke@ecomp.ufsm.br
*/


#ifndef _BASEDEF_ // Last updated 27/01/2013
#define _BASEDEF_

#include <time.h>
#include <Windows.h>

#pragma region Defines

//#define PKDrop

#define IDC_EXIT 9000
#define IDC_MOBRELOAD 9001
#define IDC_REBOOT 9002
#define IDC_SAVEALL 9003
#define IDC_READGUILD 9004
#define IDC_READGUILDNAME 9005
#define IDC_READGAMECONFIG 9006

#define IDC_SHUTDOWNNP 9050


#define		APP_VERSION				6975

#define		GAME_PORT				8281	  // Game server listening port, client connects to it
#define		DB_PORT					7514      // DB server listening port, Game server connects to it
#define		ADMIN_PORT				8895	  // DB server listening port, NPTool connects to it


#define SECRET_ROOM_N_INITIAL				2395

#define SECRET_ROOM_N_SALA1_MOB_1			2395
#define SECRET_ROOM_N_SALA1_MOB_2			2396
#define SECRET_ROOM_N_SALA2_MOB_1			2397
#define SECRET_ROOM_N_SALA2_MOB_2			2398
#define SECRET_ROOM_N_SALA3_MOB_1			2399
#define SECRET_ROOM_N_SALA3_MOB_2			2400
#define SECRET_ROOM_N_SALA4_MOB_1			2401
#define SECRET_ROOM_N_SALA4_MOB_2			2402
#define SECRET_ROOM_N_SALA4_MOB_3			2403
#define SECRET_ROOM_N_SALA4_MOB_4			2404

#define SECRET_ROOM_N_END					2402
#define SECRET_ROOM_N_BOSS_INITIAL			2403

#define SECRET_ROOM_M_INITIAL				2405

#define SECRET_ROOM_M_SALA1_MOB_1			2405
#define SECRET_ROOM_M_SALA1_MOB_2			2406
#define SECRET_ROOM_M_SALA2_MOB_1			2407
#define SECRET_ROOM_M_SALA2_MOB_2			2408
#define SECRET_ROOM_M_SALA3_MOB_1			2409
#define SECRET_ROOM_M_SALA3_MOB_2			2410
#define SECRET_ROOM_M_SALA4_MOB_1			2411
#define SECRET_ROOM_M_SALA4_MOB_2			2412
#define SECRET_ROOM_M_SALA4_MOB_3			2413
#define SECRET_ROOM_M_SALA4_MOB_4			2414

#define SECRET_ROOM_M_END					2412
#define SECRET_ROOM_M_BOSS_INITIAL			2413

#define SECRET_ROOM_A_INITIAL				2415

#define SECRET_ROOM_A_SALA1_MOB_1			2415
#define SECRET_ROOM_A_SALA1_MOB_2			2416
#define SECRET_ROOM_A_SALA2_MOB_1			2417
#define SECRET_ROOM_A_SALA2_MOB_2			2418
#define SECRET_ROOM_A_SALA3_MOB_1			2419
#define SECRET_ROOM_A_SALA3_MOB_2			2420
#define SECRET_ROOM_A_SALA4_MOB_1			2421
#define SECRET_ROOM_A_SALA4_MOB_2			2422
#define SECRET_ROOM_A_SALA4_MOB_3			2423
#define SECRET_ROOM_A_SALA4_MOB_4			2424

#define SECRET_ROOM_A_END					2422
#define SECRET_ROOM_A_BOSS_INITIAL			2423

#define NIGHTMARE_N_INITIAL					2368
#define NIGHTMARE_N_END						2375

#define NIGHTMARE_M_INITIAL					2377
#define NIGHTMARE_M_END						2384

#define NIGHTMARE_A_INITIAL					2385
#define NIGHTMARE_A_END						2394

#define RUNEQUEST_LV0_LICH1					5653
#define RUNEQUEST_LV0_LICH2					5654

#define RUNEQUEST_LV1_TORRE1				5706
#define RUNEQUEST_LV1_TORRE2				5707
#define RUNEQUEST_LV1_TORRE3				5708

#define RUNEQUEST_LV1_MOB_INITIAL			5709
#define RUNEQUEST_LV1_MOB_END				5764

#define RUNEQUEST_LV2_MOB_BOSS				5789
#define RUNEQUEST_LV2_MOB_INITIAL			5790
#define RUNEQUEST_LV2_MOB_END				5848

#define RUNEQUEST_LV3_MOB_SULRANG_INITIAL	5972
#define RUNEQUEST_LV3_MOB_SULRANG_END		5975

#define RUNEQUEST_LV3_MOB_BOSS_INITIAL		5948
#define RUNEQUEST_LV3_MOB_BOSS_END			5955

#define RUNEQUEST_LV4_MOB_INITIAL			5854
#define RUNEQUEST_LV4_MOB_END				5898
#define RUNEQUEST_LV4_MOB_BOSS				5849

#define RUNEQUEST_LV5_MOB_BOSS				5899

#define RUNEQUEST_LV6_MOB_INITIAL			5775
#define RUNEQUEST_LV6_MOB_END				5785
#define RUNEQUEST_LV6_MOB_INITIAL2			5768
#define RUNEQUEST_LV6_MOB_END2				5774
#define RUNEQUEST_LV6_MOB_BOSS				5767

#define RVRTORRE_1							4236
#define RVRTORRE_2							4237

#define GTORRE								1078

#define KEFRA_BOSS							396
#define KEFRA_MOB_INITIAL					397
#define KEFRA_MOB_END						400

////////////////////////////////////////////////////////////

#pragma endregion

#pragma region Structures

struct STRUCT_ITEM
{
	short sIndex;
	union
	{
		short sValue;

		struct
		{
			unsigned char cEffect;
			unsigned char cValue;
		};

	}stEffect[3];
};

struct STRUCT_SCORE
{
	int Level;	 // The mob's level
	int Ac;		 // The mob's defense
	int Damage;   // The mob's damage force

	unsigned char  Merchant; // UNK
	unsigned char  AttackRun; // The mob's speed
	unsigned char  Direction;
	unsigned char  ChaosRate;

	int MaxHp;     // The max HP the mob can have
	int MaxMp;	  // The max MP the mob can have
	int Hp;		  // The current HP of the mob
	int Mp;		  // The current MP of the mob

	short		   Str;		  // The mob's strength points, affects it's attack power
	short		   Int;		  // The mob's intelligence points, affects it's skill attack powers and MP
	short		   Dex;		  // The mob's dexterity points, affects it's attack speed
	short		   Con;       // The mob's constitution points, affects it's HP

	short  Special[4]; // The mob's special points, affects it's skill tiers
};

struct STRUCT_MOB
{
	char		   MobName[NAME_LENGTH];	  // The name of the mob
	char		   Clan;		  // The clan the mob belongs to
	unsigned char  Merchant;	  // The mob's merchant ID
	unsigned short Guild;		  // The ID of the guild the mob belongs to
	unsigned char  Class;		  // The mobs class
	unsigned short  Rsv;
	unsigned char Quest;

	int			   Coin;		  // The ammount of coins the mob has

	long long   Exp;			  // The ammount of experience the mob has to level up

	short		   SPX;			 // The Y position saved by the stellar gem, to teleport the mob there when using warp scroll
	short		   SPY;			 // The Y position saved by the stellar gem, to teleport the mob there when using warp scroll

	STRUCT_SCORE   BaseScore;    // The base score of the mob 
	STRUCT_SCORE   CurrentScore; // The score the mob actually has

	STRUCT_ITEM    Equip[MAX_EQUIP];	 // The items the mob is wearing
	STRUCT_ITEM	   Carry[MAX_CARRY];	 // The items the mob is carrying

	long LearnedSkill; // The skills the mob learned, divided into four categories (00 _ 00 _ 00 _ 00)

	unsigned int Magic;

	unsigned short ScoreBonus;   // The points the mob can use to increase score (Str, Int, Dex, Con)
	unsigned short SpecialBonus; // The points the mob can use to increase special, to increase effect of learned skills (score->Special[4])
	unsigned short SkillBonus;	 // The points the mob can use to buy skills

	unsigned char  Critical;	 // The chance the mob has to deliver critical hits
	unsigned char  SaveMana;	 // Uknown use, nomenclature of variable is correct to all current standards

	unsigned char  SkillBar[4];  // The skills saved on the first 4 slots of the skill bar

	unsigned char  GuildLevel;   // The mob's guuld level, used to define if it's a guild member or leader

	unsigned short  RegenHP;		 // UNK
	unsigned short  RegenMP;		 // UNK

	char  Resist[4];	 // The mob's resistencies, to fire / ice / thunder / magic

};

struct STRUCT_MOBEXTRA
{
	short ClassMaster;
	char  Citizen;

	int	  Fame;

	char  Soul;

	short MortalFace;

	struct
	{
		struct
		{
			char Newbie;//00_01_02_03_04  quest com quatro etapas
			char TerraMistica;//0 : não pegou a quest 1: pegou a quest e não concluiu 2: quest completa
			char MolarGargula;
			char PilulaOrc;

			char EMPTY[30];
		}Mortal;

		struct
		{
			char MortalSlot;
			char MortalLevel;

			char Level355;
			char Level370;

			char Cristal;//00_01_02_03_04 quest com quatro etapas

			char EMPTY[30];
		}Arch;

		struct
		{
			short ArchLevel;
			short CelestialLevel;
			short SubCelestialLevel;

			char Lv40;
			char Lv90;

			char Add120;
			char Add150;
			char Add180;
			char Add200;

			char Arcana;
			char Reset;

			char EMPTY[30];
		}Celestial;

		char Circle;
		char EMPTY[30];

	}QuestInfo;

	struct
	{
		int Class;

		long long   Exp;			  // The ammount of experience the mob has to level up

		short		   SPX;			 // The Y position saved by the stellar gem, to teleport the mob there when using warp scroll
		short		   SPY;			 // The Y position saved by the stellar gem, to teleport the mob there when using warp scroll

		STRUCT_SCORE   BaseScore;    // The base score of the mob 

		long LearnedSkill; // The skills the mob learned, divided into four categories (00 _ 00 _ 00 _ 00)


		unsigned short ScoreBonus;   // The points the mob can use to increase score (Str, Int, Dex, Con)
		unsigned short SpecialBonus; // The points the mob can use to increase special, to increase effect of learned skills (score->Special[4])
		unsigned short SkillBonus;	 // The points the mob can use to buy skills

		unsigned char  SkillBar1[4];  // The skills saved on the first 4 slots of the skill bar
		unsigned char  SkillBar2[16];  // The skills saved on the first 4 slots of the skill bar

		char Soul;
		char EMPTY[30];
	}SaveCelestial[2];

	time_t LastNT;
	int NT;

	int KefraTicket;

	time_t DivineEnd;

	unsigned int Hold;

	struct
	{
		long long Exp;
		int		  YearDay;
	}DayLog;

	struct
	{
		time_t LastTime;
		int Count;
	}DonateInfo;

	int EMPTY[9];
};

struct STRUCT_AFFECT
{
	unsigned char Type;
	unsigned char Value;
	unsigned short Level;
	unsigned int Time;
};

struct STRUCT_LEVELBONUS
{
	unsigned short Level;
	unsigned short ScoreBonus;   // The points the mob can use to increase score (Str, Int, Dex, Con)
	unsigned short SpecialBonus; // The points the mob can use to increase special, to increase effect of learned skills (score->Special[4])
	unsigned short SkillBonus;	 // The points the mob can use to buy skills
	unsigned short Ac;
};

struct STRUCT_CAPSULE
{
	STRUCT_MOB MOB;
	STRUCT_MOBEXTRA extra;
};

struct STRUCT_BEASTBONUS
{
	int Unk; // MinDamAdd ? // 0
	int Unk2; // MaxDamAdd ? // 4
	int Unk3; // MinAcAdd ? // 8
	int Unk4; // MaxAcAdd ? //12
	int Unk5; // MinHpAdd ? // 16
	int Unk6; // MaxHpAdd ? // 20
	int Unk7; // RunSpeedBonus ? // 24
	int Unk8; // 28
	int Unk9; // AttackSpeedBonus ? // 32
	int Unk10; // 36
	int Unk11; // 40
	int Unk12; // 44 
	int Unk13; // 48
	int Unk14; // 52
	int Unk15; // 56
	int Unk16; // 60
	int Unk17; // BaseSanc ? // 64
};

struct STRUCT_TREASURE
{
	short Source;

	STRUCT_ITEM Target[5];

	short Rate[5];
};

struct STRUCT_PISTA
{
	struct
	{
		short LeaderID;
		char  LeaderName[NAME_LENGTH];

		int Sala;
		int MobCount;
	}Party[3];
};

struct STRUCT_CASTLEQUEST
{
	int MOB_INITIAL;
	int MOB_END;
	int BOSS[2];

	STRUCT_ITEM Prize[MAX_CARRY];
	int			CoinPrize;
	int			ExpPrize[6];
	int			PartyPrize;

	int			QuestTime;
};

struct STRUCT_MERC
{
	int GenerateIndex;
	char MobName[NAME_LENGTH];

	STRUCT_ITEM Carry[MAX_CARRY];
	short		Stock[MAX_CARRY];
	short		MaxStock[MAX_CARRY];
	int			RenewTime;
	int			RebornTime;
};

struct STRUCT_CAMP
{
	int			BauIndex;
	int			BauQuest;
	char		BauName[256];
	int			KeyIndex;

	int			MOB_INITIAL;
	int			MOB_END;

	int			MobX;
	int			MobY;
	int			BauX;
	int			BauY;
	int			BauRotate;


	STRUCT_ITEM Prize[MAX_CAMP_PRIZE];
	int			CoinPrize;
	int			ExpPrize[6];
	int			PartyPrize;

	int			RenewTime;
};

struct STRUCT_ITEMLOG
{
	int	Num;
};

struct STRUCT_GUILDZONE
{
	int ChargeGuild;
	int ChallangeGuild;

	int GuildSpawnX;
	int GuildSpawnY;

	int CitySpawnX;
	int CitySpawnY;

	int CityLimitX1;
	int CityLimitY1;
	int CityLimitX2;
	int CityLimitY2;

	int WarAreaX1;
	int WarAreaY1;
	int WarAreaX2;
	int WarAreaY2;

	int ChargeWarSpawnX;
	int ChargeWarSpawnY;

	int ChallangeWarSpawnX;
	int ChallangeWarSpawnY;

	int CityTax;
	int Clan;
	int Victory;
};

struct STRUCT_SEALOFSOUL
{
	int Read;
	int MortalClass;
	int ClassCele;
	int SubClass;
	int LevelCele;
	int LevelSub;
	int For;
	int Int;
	int Dex;
	int Con;
	int ScoreBonus;
	int SkillPoint;
	int ArchQuest;
	int CelestialQuest;
	int ArcanaQuest;
};

struct STRUCT_SELCHAR
{
	short SPX[4];
	short SPY[4];
	char Name[4][16];

	STRUCT_SCORE Score[4];
	STRUCT_ITEM  Equip[4][16];

	unsigned short Guild[4];

	int Coin[4];
	long long Exp[4];
};

struct STRUCT_ACCOUNTINFO
{
	char AccountName[ACCOUNTNAME_LENGTH];
	char AccountPass[ACCOUNTPASS_LENGTH];

	char RealName[REALNAME_LENGTH];
	int  SSN1;
	int  SSN2;
	char Email[EMAIL_LENGTH];
	char Telephone[TELEPHONE_LENGTH];
	char Address[ADDRESS_LENGTH];
	char NumericToken[6];

	int Year;
	int YearDay;
};
typedef struct
{
	short Fame;

	char Clan;
	char Citizen;

	char Sub1;
	char Sub2;
	char Sub3;
} STRUCT_GUILDINFO;

#pragma pack(push, 1)
struct STRUCT_RANKING
{
	STRUCT_RANKING()
	{
		Name[0] = '\0';
		Value = 0;
		ClassMaster = 0;
		Level = 0;
		Class = 0;
	}

	STRUCT_RANKING(char* name, long long value, int classvalue, int level, int cls)
	{
		strncpy(Name, name, sizeof(Name));
		Value = value;
		ClassMaster = classvalue;
		Level = level;
		Class = cls;
	}

	char Name[32];
	long long Value;
	int ClassMaster;
	int Level;
	int Class;
};
#pragma pack(pop)
#pragma endregion

#pragma region File Structures

struct STRUCT_ACCOUNTFILE
{
	STRUCT_ACCOUNTINFO Info; // 0 - 216

	STRUCT_MOB	Char[MOB_PER_ACCOUNT]; // 216 - 3480
	STRUCT_ITEM Cargo[MAX_CARGO]; // 3480 - 4504
	int			Coin; // 4504 - 4508

	unsigned char ShortSkill[MOB_PER_ACCOUNT][16]; // 4508 - 4572

	STRUCT_AFFECT affect[MOB_PER_ACCOUNT][MAX_AFFECT];
	STRUCT_MOBEXTRA mobExtra[MOB_PER_ACCOUNT];

	int Donate;

	char TempKey[52];
};

struct STRUCT_SPELL
{
	int	SkillPoint;
	int	TargetType;
	int	ManaSpent;
	int	Delay;
	int	Range;
	int	InstanceType;
	int	InstanceValue;
	int	TickType;
	int	TickValue;
	int	AffectType;
	int	AffectValue;
	int	AffectTime;
	unsigned char Act[8];
	int	InstanceAttribute;
	int	TickAttribute;
	int	Aggressive;
	int	MaxTarget;
	int	bParty;
	int	AffectResist;
	int	Passive;
};

struct STRUCT_ITEMLIST
{
	char					Name[ITEMNAME_LENGTH];
	short				IndexMesh;
	short				IndexTexture;
	short				IndexVisualEffect;
	short				ReqLvl;
	short				ReqStr;
	short				ReqInt;
	short				ReqDex;
	short				ReqCon;

	struct
	{
		short sEffect;
		short sValue;

	} stEffect[MAX_STATICEFFECT];

	int					Price; // 92
	short				nUnique; // 96
	short				nPos; // 98
	short				Extra; // 100
	short				Grade; // 102 1 = Normal 2 = Mistico = 3 Arcano 4 = Le
};

struct STRUCT_INITITEM
{
	short PosX;
	short PosY;
	short ItemIndex;
	short Rotate;
};

struct STRUCT_BLOCKMAC
{
	int Mac[4];
};

#pragma endregion

#pragma region Messages defines and structures

#define _MSG      	short		  Size;			\
					char		  KeyWord;		\
					char		  CheckSum;		\
					short		  Type;			\
					short		  ID;			\
					unsigned int  ClientTick;

const int FLAG_GAME2CLIENT			= 0x0100;
const int FLAG_CLIENT2GAME			= 0x0200;

const int FLAG_DB2GAME				= 0x0400;
const int FLAG_GAME2DB				= 0x0800;

const int FLAG_DB2NP				= 0x1000;
const int FLAG_NP2DB				= 0x2000;

const int FLAG_NEW					= 0x4000;

struct		 MSG_STANDARD
{
	_MSG;
};

struct		 MSG_STANDARDPARM
{
	_MSG;
	int Parm;
};

struct		 MSG_STANDARDPARM2
{
	_MSG;
	int Parm1;
	int Parm2;
};

struct		 MSG_STANDARDSHORTPARM2	
{
	_MSG;
	short Parm1;
	short Parm2;
};

struct		 MSG_STANDARDPARM3
{
	_MSG;
	int Parm1;
	int Parm2;
